#1) კომენტარის სახით ახსენით რას აკეთებს len(), append(), insert() და pop() ფუნქციები

# ln() - აბრუნებს სიის ან სტრიქონის სიგრძეს 
# apqend() - სიის ბოლოში სამატებს  ახალ ელემენთს 
# inzert() - სიაში ამატებს ელმენტს კონკრეტულ ინდექსზე
# pop() - სიიდან შლის კონკრეტულ ელემენტს 


#2) შექმენით სია და შეინახეთ  5 სახელი. მომხმარებელს შემოატანინეთ სახელი და დაამატეთ ამ სიაში. ბოლოს, დაბეჭდეთ ამ სიის სიგრძე და სიის განახლებული ვერსია.


საზელები = ["იოანე", "ვანო", "გიორგი", "ტამარი", "ლიკა"]
ახალი_სახელი = input("გთხოვთ, შეიყვანეთ სახელი: ")
საზელები.append(ახალი_სახელი)
print("სიის სიგრდზე:", len(საზელები))
print("განახლებული სია:", საზელები)


#3) შექმენით სია: fruits = ["Melon", "Orange", "Banana", "Watermelon", "Kiwi"]
#ამოაგდეთ სიიდან ბოლო ელემენტი და მესამე ინდექსზე ჩასვით "Pomegranate".

fruits = ["melon", "oorange", "banana", "wathermelon", "kiwi"]
fruits.pop()
fruits.insert(3,"Pomegranate")
print(fruits)









